Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry.GetProvider(Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry.GetProvider(System.Guid)
Since:
2025

Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry.UnregisterProvider(Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry.UnregisterProvider(System.Guid)
Since:
2025

Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry.RegisterProvider(Autodesk.Revit.DB.ElementId,Autodesk.Revit.UI.IParamDefExternalButtonUIProvider)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry.RegisterProvider(System.Guid,Autodesk.Revit.UI.IParamDefExternalButtonUIProvider)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ParamDefExternalButtonUIProviderRegistry
ParamDefExternalButtonUIProviderRegistry
Since:
2025